---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotPlaceRailingOnStringerWarning
source: html/b4c5e8e8-77d2-6ee6-d10c-2446310a31e0.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotPlaceRailingOnStringerWarning Property

Railing is placed on tread because there is no stringer.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotPlaceRailingOnStringerWarning { get; }
```